Repository: n8rob/corpora
Catalog: french_haitian/archive/en-ht (1).tmx
Source language: en
Languages: ht

source: And this neuron right here, this is called the presynaptic neuron.
ht: Et droit ewonn sa a isit la, sa rele ewonn presynaptic a.

source: It's good to have a little terminology under our belt.
ht: Li ta pi bon pou gen yon ti terminologie anba ceinture nou.

source: This is the post-synaptic neuron.
ht: Sa se ewonn post-synaptic a.

source: And the space between the two neurons, between this axon and this dendrite, this is called the synaptic cleft.
ht: Et la ant ant sa a axon de neurones Et dendrite sa a, sa rele palèt synaptic a.

source: It's a really small space in the terms of-- so what we're going to deal with in this video is a chemical synapse.
ht: Li se yon vrèman ti distans nan tèm - se poutèt sa nou ap va pou fè fas nan videyo sa a se yon synapse chimik.

source: In general, when people talk about synapses, they're talking about chemical synapses.
ht: An jeneral, lè moun pale osijè de synapses, yo ap pale osijè de synapses chimik.

source: There also are electrical synapses, but I won't go into detail on those.
ht: Gen tou ki synapses elektrik, men m pa p fè nan detay sou moun.

source: This is kind of the most traditional one that people talk about.
ht: Sa a se yon ti jan pi tradisyonèl ke moun fè ti pale.

source: So your synaptic cleft in chemical synapses is about 20 nanometers, which is really small.
ht: Se konsa, ou palèt synaptic nan synapses chimik se Sur 20 nanometers, ki se vrèman ti.

source: If you think about the average width of a cell as about 10 to 100 microns-- this micron is 10 to the minus 6.
ht: Si ou panse osijè de lajè mwayèn de yon selil kòm Sur 10 pou 100 microns - micron sa a se 10 pou le moins 6.

source: This is 20 times 10 to the minus 9 meters.
ht: Sa se 10 20 tan pou mèt 9 moins yo.

source: So this is a very small distance and it makes sense because look how big the cells look next to this small distance.
ht: Se poutèt sa a se yon ti distans Et li fè sans paske gade jan gwo les cellules gade kap vini pou ti distans sa a.

source: So it's a very small distance and you have-- on the presynaptic neuron near the terminal end, you have these vesicles.
ht: Se konsa, li se yon ti distans Et ou gen - sou a ewonn presynaptic près de fè tou, sa li ou gen dechay sa yo.

source: Remember what vesicles were.
ht: Sonje dechay ont.

source: These are just membrane bound things inside of the cell.
ht: Se sa sèlman len lié bagay andedan sèlil a yo.

source: So you have these vesicles.
ht: Se konsa, ou gen dechay sa yo.

source: They also have their phospobilipid layers, their little membranes.
ht: Yo gen tou couches phospobilipid yo, yo ti membranes.

source: So you have these vesicles so these are just-- you can kind of view them as containers.
ht: Se konsa, ou gen dechay sa yo, se poutèt sa, se sa sèlman ki ou kapab jan ki wè yo tankou kontenè.

source: I'll just draw one more just like that.
ht: M ap jis trase yon pi jis kon sa.

source: And they can train these molecules called neurotransmitters and I'll draw the neurotransmitters in green.
ht: Et sa yo kapab egzèse molécules sa yo te rele •, m' ap trase a • nan vèt.

source: So they have these molecules called neurotransmitters in them.
ht: Se konsa yo gen molécules sa yo te rele • nan yo.

source: You've probably heard the word before.
ht: Ou te konn pwobableman tande pawòl la, devan.

source: In fact, a lot of drugs that people use for depression or other things related to our mental state, they affect neurotransmitters.
ht: An reyalite, yon bann dwo'g ke moun ki itilize pou kè mare/sere ou lòt bagay ki gen rapò deta nan tèt nou, pou yo aji sou •.

source: I won't go into detail there, but they contain these neurotransmitters.
ht: M pa p fè nan detay la, men, yo genyen sa yo •.

source: And when the calcium channels-- they're voltage gated-- when it becomes a little more positive, they open calcium floods in and what the calcium does is, it bonds to these proteins that have docked these vesciles.
ht: Et lè chèn televizyon kalsyòm - yo ap vòltaj gated - lè li parèt tankou yon ti jan plis pozitif, yo louvri kalsyòm inondasyon nan Et ki tout alsyòm sa se li obligations pou protéines sa yo ki te Station vesciles sa yo.

source: So these little vesicles, they're docked to the presynpatic membrane or to this axon terminal membrane right there.
ht: Se poutèt sa yo ti kras dechay, yo ap Station pou a presynpatic len ou pou sa a axon len de fè isit-la.

source: These proteins are actually called SNARE proteins.
ht: Protéines sa yo ki aktyèlman ap rele protéines SNARE.

source: It's an acronym, but it's also a good word because they've literally snared the vesicles to this membrane.
ht: Li se yon acronym, men se bon tou yon bon pawòl yo te gen mo pou mo snared dechay pou len sa a.

source: So that's what these proteins are.
ht: Se poutèt sa se sa protéines sa yo ye.

source: And when these calcium ions flood in, they bond to these proteins, they attach to these proteins, and they change the confirmation of the proteins just enough that these proteins bring these vesicles closer to the membrane and also kind of pull apart the two membranes so that the membranes merge.
ht: Et lè sa yo ions kalsyòm inondations nan, yo bond yo protéines, yo kole pou protéines sa yo, Et yo chanje a konfimasyon de protéines jis kont sa yo protéines pote dechay sa yo tou pwe a len Et tou kalite rale outre membranes de sa a amalgame membranes.

source: Let me do a zoom in of that just to make it clear what's going on.
ht: Kite m' fè yon zoom de sa sèlman pou fè wè sa k ap fèt.

source: So after they've bonded-- this is kind of before the calcium comes in, bonds to those SNARE proteins, then the SNARE protein will bring the vesicle ultra-close to the presynaptic membrane.
ht: Se konsa apwè yo te gen) - sa se kalite devan tout alsyòm te vini, obligations pou protéines SNARE sa, lè sa a SNARE protéines pwal pote ultra-close pou outon dlo len presynaptic a.

source: So that's the vesicle and then the presynaptic membrane will look like this and then you have your SNARE proteins.
ht: Se konsa sa se outon dlo a, lè sa a presynaptic len Sera sanble tankou sila a, lè sa a ou pran ou protéines SNARE.

source: And I'm not obviously drawing it exactly how it looks in the cell, but it'll give you the idea of what's going on.
ht: Epi mwen menm pa evidamman dessin li egzateman jan li parèt a selil, men, li ap ba ou konnen ki sa k ap fèt.

source: Your SNARE proteins have essentially pulled the things together and have pulled them apart so that these two membranes merge.
ht: Protéines SNARE ou esansyèlman retire bagay yo ansanm ont kase yo separe sa yo de amalgame membranes.

source: And then the main side effect-- the reason why all this is happening-- is it allows those neurotransmitters to be dumped into the synaptic cleft. So those neurotransmitters that were inside of our vesicle then get dumped into the synaptic cleft.
ht: Lè sa a pwensipal bò effet-la raison Et Poukisa tout sa k - ap pase se li ki pèmèt • sa pou être UN nan bèk synaptic a. • Se konsa moun sa yo te fèt andedan nou outon dlo lè sa a obtenir UN nan bèk synaptic a.

source: This process right here is called exocytosis.
ht: Isit-menm pwosesis sa a te rele exocytosis.

source: It's exiting the cytoplasm, you could say, of the presynaptic neuron. These neurotransmitters-- and you've probably heard the specific names of many of these-- serotonin, dopamine, epinephrine-- which is also adrenaline, but that's also a hormone, but it also acts as a neurotransmitter.
ht: Li sortie cytoplasm a, ou te kapab di, de la ewonn presynaptic. • Sa yo ­ Et ou te konn pwobableman tande a espesifik non anpil nan men ­ comme, dopamine, votre - ki se osi drenalin, men tou se yon monn, men, li tou zak kòm yon neurotransmetteur.

source: Norepinephrine, also both a hormone and a neurotransmitter.
ht: Norepinephrine, tou de yon monn ak yon neurotransmetteur.

source: So these are words that you've probably heard before.
ht: Se poutèt sa, se sa pawòl ou te konn pwobableman tande devan yo.

source: But anyway, these enter into the synaptic cleft and then they bond on the surface of the membrane of the post-synaptic neuron or this dendrite.
ht: Men, de tout fason, sa antre nan bèk synaptic a, lè sa a yo bond sou sifas len de la ewonn Post-synaptic ou dendrite sa a.

source: Let's say they bond here, they bond here, and they bond here.
ht: An n di yo bond isit la, yo isit la bond, e yo bond isit la.

source: So they bond on special proteins on this membrane surface, but the main effect of that is, that will trigger ion channels.
ht: Se konsa yo bond sou protéines espesyal sou len sa a sifas, men, pi gwo efè sa se, ki ap itilize ion canaux.

source: So let's say that this neuron is exciting this dendrite.
ht: Se konsa nou di ke ewonn sa a intéressantes dendrite sa a.

source: So when these neurotransmitters bond on this membrane, maybe sodium channels open up.
ht: Se konsa, lè sa biologie bond sou sa len, petèt odyòm canaux louvri.

source: So maybe that will cause a sodium channel to open up.
ht: Se konsa gen dwa sa pwal koze yon chanèl odyòm pou.

source: So instead of being voltage gated, it's neurotransmitter gated.
ht: Se konsa olye de cours vòltaj gated, li genyen neurotransmetteur gated.

source: So this will cause a sodium channel to open up and then sodium will flow in and then, just like we said before, if we go to the original one, that's like this getting excited, it'll become a little bit positive and then if it's enough positive, it'll electrotonically increase the potential at this point on the axon hillock and then we'll have another neuron-- in this case, this neuron being stimulated.
ht: Se konsa sa pral lakòz yon chanèl Sodyòm pou, lè sa a odyòm yo va flux nan, lè sa a, tout jan nou te di anvan: Si nou ale nan orijinal youn, se konmsi sa a eksitan, li ap vin yon ti jan pozitif, lè sa a si li se ase pozitif, sa ap electrotonically monte a potansyèl nan pwen sa sou axon a bit tè. Lè sa a nou ap gen yon lòt ewonn - nan ka sa, sa a ewonn être stimuler.

source: So that's essentially how it happens.
ht: Se poutèt sa se esansyèlman jan l' rive.

source: It actually could be inhibitory.
ht: Li aktyèlman kapab byen inhibiteurs.

source: You could imagine if this, instead of triggering a sodium ion channel, if it triggered a potassium ion channel.
ht: Ou te kapab imajine si sa a, olye de déclenchement yon Sodyòm ion chanèl, si li a yon chanèl ion Potasyòm.

source: If it triggered a potassium ion channel, potassium ion's concentration gradient will make it want to go outside of the cell.
ht: Si li a yon Potasyòm ion chanèl, Potasyòm ion konsantrasyon dégradé an, ap fè l' vle ale deyò sèlil a.

source: So positive things are going to leave the cell if it's potassium.
ht: Se konsa pozitif sa pwal kite a selil si se Potasyòm.

source: Remember, I used triangles for potassium.
ht: Pa bliye, mwen te konn sipèpoze pou Potasyòm.

source: And so if positive things leave the cell, then if you go further down the neuron, it'll become less positive and so it'll be even harder for the action potential to start up because it'll need even more positive someplace else to make the threshold gradient.
ht: Et si bagay pozitif kite sèlil a, lè sa a si ou prale plus desann ewonn a, sa ap tounen mwens pozitif Et pour l ap fè menm plus pou aksyon potansyèl pou yo kòmanse paske li bezwen plis toujou. nou pozitif someplace lòt moun pou fè pou sekirite sosyal a dégradé.

source: I hope I'm not confusing you when I say that.
ht: Mwen espere ke mwen menm Confusion ou lè m' ap di sa.

source: So this connection, the way I first described it, it's exciting.
ht: Se konsa koneksyon sa a, jan mwen premye te dekri li, li panse a eksitan.

source: When this guy gets excited from an action potential, calcium floods in.
ht: Lè sa a l' eksitan de yon aksyon potentiels, kalsyòm inondasyon an.

source: It makes these vesicles dump their contents in the synaptic cleft and then that will make other sodium gates open up and then that will stimulate this neuron, but if it makes potassium gates open up, then it will inhibit it-- and that's how, frankly, these synapses work.
ht: Li fè sa yo dechay image yo sa nan synaptic a ki nan liv nvi Et lè sa a ki ap fè lòt Sodyòm gates louvri Et Lè sa a ki ap chofe ewonn sa a, men, si li fè Potasyòm gates louvri, puis li pral empêcher l-- Et sa se jan, kare, synapses sa yo travay.

source: I was about to say there's millions of synapses, but that'd be incorrect.
ht: Mwen te gen pou di se dè milyon de synapses, men sa ta kapab pa kòrèk.

source: There's trillions of synapses.
ht: Pa gen trillions de synapses.

source: The best estimate of the number of synapses in our cerebral cortex is 100 to 500 trillion synapses just in the cerebral cortex.
ht: A pi bon estimation du nombre de synapses nan nou òtèks serebral se 100 pou 500 000 synapses jis nan a òtèks serebral.

source: The reason why we can have so many is that one neuron can actually form many, many, many, many synapses.
ht: An rezon ki te Poukisa nou ka gen anpil se sa ewonn yon ka aktyèlman fòme anpil, anpil, anpil, anpil synapses.

source: I mean, you can imagine if this original drawing of a cell, you might have a synapse here, a synapse here, a synapse there.
ht: Mwen vle di, ou ka konprann si sa a orijinal trase yon de yon selil, ou te ka jwenn yon synapse isit la, yon synapse isit la, yon synapse la.

source: You could have hundreds or thousands of synapses even, into one neuron or going out of one neuron.
ht: Ou te kapab gen dè santèn ou dè milye de synapses menm, nan yon sèl ewonn ou t' ap soti nan yon sèl ewonn.

source: This might be a synapse with one neuron, another one, another one, another one.
ht: Sa te kapab yon synapse ak yon sèl ewonn, yon lòt moun, yon lòt moun, yon lòt moun.

source: So you'd have many, many, many, many, many connections.
ht: Se konsa nou ta anpil anpil, anpil, anpil, anpil koneksyon.

source: And so synapses are really what give us the complexity of what probably make us tick in terms of our human mind and all of that.
ht: Se konsa synapses se vrèman sa ban nou konpleksite de sa kapab byen fè nou Tik tèm nou bliye moun Et tout de sa.

source: But anyway, hopefully you found this useful.
ht: Men, de tout fason, ak lespwa ke ou jwenn sa itil yo.
